pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_radiocore_peripherals.h
/*

Copyright (c) 2010 - 2025, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF9230_ENGB_RADIOCORE_PERIPHERALS_H
#define NRF9230_ENGB_RADIOCORE_PERIPHERALS_H

#ifdef __cplusplus
    extern "C" {
#endif

#include <stdbool.h>
/*CACHEDATA*/
#define ICACHEDATA_PRESENT 1
#define ICACHEDATA_COUNT 1

#define ICACHEDATA_NUMSETS 256
#define ICACHEDATA_NUMWAYS 2
#define ICACHEDATA_NUMDATAUNIT 4
#define ICACHEDATA_DATAWIDTH 2

/*CACHEINFO*/
#define ICACHEINFO_PRESENT 1
#define ICACHEINFO_COUNT 1

#define ICACHEINFO_NUMSETS 256
#define ICACHEINFO_NUMWAYS 2
#define ICACHEINFO_NUMDATAUNIT 4
#define ICACHEINFO_DATAWIDTH 2
#define ICACHEINFO_TAGWIDTH 19
#define ICACHEINFO_DU_EXTENSION 0

/*User information configuration registers*/
#define UICR_PRESENT 1
#define UICR_COUNT 1

/*CACHEDATA*/
#define DCACHEDATA_PRESENT 1
#define DCACHEDATA_COUNT 1

#define DCACHEDATA_NUMSETS 256
#define DCACHEDATA_NUMWAYS 2
#define DCACHEDATA_NUMDATAUNIT 8
#define DCACHEDATA_DATAWIDTH 1

/*CACHEINFO*/
#define DCACHEINFO_PRESENT 1
#define DCACHEINFO_COUNT 1

#define DCACHEINFO_NUMSETS 256
#define DCACHEINFO_NUMWAYS 2
#define DCACHEINFO_NUMDATAUNIT 8
#define DCACHEINFO_DATAWIDTH 1
#define DCACHEINFO_TAGWIDTH 19
#define DCACHEINFO_DU_EXTENSION 1

/*Embedded Trace Macrocell*/
#define ETM_PRESENT 1
#define ETM_COUNT 1

/*Cross-Trigger Interface control*/
#define CTI_PRESENT 1
#define CTI_COUNT 3

/*CM33 SubSystem*/
#define CM33SS_PRESENT 1
#define CM33SS_COUNT 1

#define CPUC_FPUAVAILABLE 1

/*Cache*/
#define CACHE_PRESENT 1
#define CACHE_COUNT 2

#define ICACHE_VIRTUALCACHE 0
#define ICACHE_FLUSH 0
#define ICACHE_CLEAN 0
#define ICACHE_NONCACHEABLEMISS 1
#define ICACHE_BUSWIDTH_MIN 0
#define ICACHE_BUSWIDTH_MAX 63
#define ICACHE_BUSWIDTH_SIZE 64
#define ICACHE_SECUREINVALIDATE 0

#define DCACHE_VIRTUALCACHE 0
#define DCACHE_FLUSH 1
#define DCACHE_CLEAN 1
#define DCACHE_NONCACHEABLEMISS 1
#define DCACHE_BUSWIDTH_MIN 0
#define DCACHE_BUSWIDTH_MAX 63
#define DCACHE_BUSWIDTH_SIZE 64
#define DCACHE_SECUREINVALIDATE 0

/*System protection unit*/
#define SPU_PRESENT 1
#define SPU_COUNT 4

#define SPU000_BELLS 0
#define SPU000_IPCT 0
#define SPU000_DPPI 0
#define SPU000_GPIOTE 0
#define SPU000_GRTC 0
#define SPU000_GPIO 0
#define SPU000_CRACEN 0
#define SPU000_MRAMC 0
#define SPU000_COEXC 0
#define SPU000_ANTSWC 0
#define SPU000_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/

#define SPU010_BELLS 0
#define SPU010_IPCT 0
#define SPU010_DPPI 0
#define SPU010_GPIOTE 0
#define SPU010_GRTC 0
#define SPU010_GPIO 0
#define SPU010_CRACEN 0
#define SPU010_MRAMC 0
#define SPU010_COEXC 0
#define SPU010_ANTSWC 0
#define SPU010_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/

#define SPU020_BELLS 0
#define SPU020_IPCT 1
#define SPU020_DPPI 1
#define SPU020_GPIOTE 0
#define SPU020_GRTC 0
#define SPU020_GPIO 0
#define SPU020_CRACEN 0
#define SPU020_MRAMC 0
#define SPU020_COEXC 0
#define SPU020_ANTSWC 0
#define SPU020_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/

#define SPU030_BELLS 0
#define SPU030_IPCT 0
#define SPU030_DPPI 1
#define SPU030_GPIOTE 0
#define SPU030_GRTC 0
#define SPU030_GPIO 0
#define SPU030_CRACEN 0
#define SPU030_MRAMC 0
#define SPU030_COEXC 0
#define SPU030_ANTSWC 0
#define SPU030_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/

/*Memory Privilege Controller*/
#define MPC_PRESENT 1
#define MPC_COUNT 1

#define MPC_EXTEND_CLOCK_REQ 0
#define MPC_RTCHOKE 1
#define MPC_OVERRIDE_GRAN 4096

/*MVDMA performs direct-memory-accesses between memories. Data is transferred according to job descriptor lists. Each transfer has corresponding source and sink descriptor lists with matching data amounts. The lists are in memory and they contain data buffer information, address pointers, buffer sizes and data type attributes.*/

#define MVDMA_PRESENT 1
#define MVDMA_COUNT 3

#define MVDMA_COMPLETED_EVENT 1
#define MVDMA_DPPI_DISCONNECTED 0
#define MVDMA_INSTANCE_IN_WRAPPER 0

#define MVDMA120_COMPLETED_EVENT 1
#define MVDMA120_DPPI_DISCONNECTED 1
#define MVDMA120_INSTANCE_IN_WRAPPER 1

#define MVDMA121_COMPLETED_EVENT 1
#define MVDMA121_DPPI_DISCONNECTED 1
#define MVDMA121_INSTANCE_IN_WRAPPER 1

/*RAM Controller*/
#define RAMC_PRESENT 1
#define RAMC_COUNT 4

