pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_radiocore_peripherals.h
#define RAMC000_ECC 0
#define RAMC000_SEC 1

#define RAMC001_ECC 0
#define RAMC001_SEC 0

#define RAMC122_ECC 0
#define RAMC122_SEC 0

#define RAMC123_ECC 0
#define RAMC123_SEC 0

/*HSFLL*/
#define HSFLL_PRESENT 1
#define HSFLL_COUNT 1

#define HSFLL_DITHER_32B 1
#define HSFLL_CLOCKCTRL_MULT_RESET 6

/*LRCCONF*/
#define LRCCONF_PRESENT 1
#define LRCCONF_COUNT 3

#define LRCCONF000_POWERON 0
#define LRCCONF000_RETAIN 0
#define LRCCONF000_SYSTEMOFF 0
#define LRCCONF000_LRCREQHFXO 0
#define LRCCONF000_NCLK_MIN 0
#define LRCCONF000_NCLK_MAX 0
#define LRCCONF000_NCLK_SIZE 1
#define LRCCONF000_CLKCTRL 1
#define LRCCONF000_NACTPD_MIN 0
#define LRCCONF000_NACTPD_MAX 7
#define LRCCONF000_NACTPD_SIZE 8
#define LRCCONF000_PDACT 0
#define LRCCONF000_NPD_MIN 0
#define LRCCONF000_NPD_MAX 7
#define LRCCONF000_NPD_SIZE 8
#define LRCCONF000_OTHERON 0
#define LRCCONF000_NDOMAINS_MIN 0
#define LRCCONF000_NDOMAINS_MAX 15
#define LRCCONF000_NDOMAINS_SIZE 16
#define LRCCONF000_AX2XWAITSTATES 0
#define LRCCONF000_POWERON_MAIN_RESET 0
#define LRCCONF000_POWERON_ACT_RESET 0
#define LRCCONF000_RETAIN_MAIN_RESET 1
#define LRCCONF000_RETAIN_ACT_RESET 1

#define LRCCONF010_POWERON 1
#define LRCCONF010_RETAIN 1
#define LRCCONF010_SYSTEMOFF 1
#define LRCCONF010_LRCREQHFXO 1
#define LRCCONF010_NCLK_MIN 0
#define LRCCONF010_NCLK_MAX 0
#define LRCCONF010_NCLK_SIZE 1
#define LRCCONF010_CLKCTRL 1
#define LRCCONF010_NACTPD_MIN 0
#define LRCCONF010_NACTPD_MAX 1
#define LRCCONF010_NACTPD_SIZE 2
#define LRCCONF010_PDACT 1
#define LRCCONF010_NPD_MIN 0
#define LRCCONF010_NPD_MAX 7
#define LRCCONF010_NPD_SIZE 8
#define LRCCONF010_OTHERON 0
#define LRCCONF010_NDOMAINS_MIN 0
#define LRCCONF010_NDOMAINS_MAX 15
#define LRCCONF010_NDOMAINS_SIZE 16
#define LRCCONF010_AX2XWAITSTATES 0
#define LRCCONF010_POWERON_MAIN_RESET 1
#define LRCCONF010_POWERON_ACT_RESET 0
#define LRCCONF010_RETAIN_MAIN_RESET 0
#define LRCCONF010_RETAIN_ACT_RESET 0

#define LRCCONF020_POWERON 0
#define LRCCONF020_RETAIN 0
#define LRCCONF020_SYSTEMOFF 0
#define LRCCONF020_LRCREQHFXO 0
#define LRCCONF020_NCLK_MIN 0
#define LRCCONF020_NCLK_MAX 7
#define LRCCONF020_NCLK_SIZE 8
#define LRCCONF020_CLKCTRL 0
#define LRCCONF020_NACTPD_MIN 0
#define LRCCONF020_NACTPD_MAX 7
#define LRCCONF020_NACTPD_SIZE 8
#define LRCCONF020_PDACT 0
#define LRCCONF020_NPD_MIN 0
#define LRCCONF020_NPD_MAX 7
#define LRCCONF020_NPD_SIZE 8
#define LRCCONF020_OTHERON 0
#define LRCCONF020_NDOMAINS_MIN 0
#define LRCCONF020_NDOMAINS_MAX 15
#define LRCCONF020_NDOMAINS_SIZE 16
#define LRCCONF020_AX2XWAITSTATES 0
#define LRCCONF020_POWERON_MAIN_RESET 0
#define LRCCONF020_POWERON_ACT_RESET 0
#define LRCCONF020_RETAIN_MAIN_RESET 1
#define LRCCONF020_RETAIN_ACT_RESET 1

/*Memory configuration*/
#define MEMCONF_PRESENT 1
#define MEMCONF_COUNT 1

#define MEMCONF_RETTRIM 1
#define MEMCONF_REPAIR 0
#define MEMCONF_POWER 1

/*Watchdog Timer*/
#define WDT_PRESENT 1
#define WDT_COUNT 4

#define WDT010_ALLOW_STOP 0
#define WDT010_HAS_INTEN 0

#define WDT011_ALLOW_STOP 0
#define WDT011_HAS_INTEN 0

#define WDT131_ALLOW_STOP 0
#define WDT131_HAS_INTEN 0

#define WDT132_ALLOW_STOP 0
#define WDT132_HAS_INTEN 0

/*RESETINFO*/
#define RESETINFO_PRESENT 1
#define RESETINFO_COUNT 1

#define RESETINFO_HASRESETREAS 1
#define RESETINFO_CROSSDOMAINRESET 1

/*Distributed programmable peripheral interconnect controller*/
#define DPPIC_PRESENT 1
#define DPPIC_COUNT 10

#define DPPIC020_HASCHANNELGROUPS 1
#define DPPIC020_CH_NUM_MIN 0
#define DPPIC020_CH_NUM_MAX 23
#define DPPIC020_CH_NUM_SIZE 24
#define DPPIC020_GROUP_NUM_MIN 0
#define DPPIC020_GROUP_NUM_MAX 3
#define DPPIC020_GROUP_NUM_SIZE 4

#define DPPIC030_HASCHANNELGROUPS 1
#define DPPIC030_CH_NUM_MIN 0
#define DPPIC030_CH_NUM_MAX 15
#define DPPIC030_CH_NUM_SIZE 16
#define DPPIC030_GROUP_NUM_MIN 0
#define DPPIC030_GROUP_NUM_MAX 0
#define DPPIC030_GROUP_NUM_SIZE 1

#define DPPIC120_HASCHANNELGROUPS 1
#define DPPIC120_CH_NUM_MIN 0
#define DPPIC120_CH_NUM_MAX 7
#define DPPIC120_CH_NUM_SIZE 8
#define DPPIC120_GROUP_NUM_MIN 0
#define DPPIC120_GROUP_NUM_MAX 1
#define DPPIC120_GROUP_NUM_SIZE 2

#define DPPIC130_HASCHANNELGROUPS 1
#define DPPIC130_CH_NUM_MIN 0
#define DPPIC130_CH_NUM_MAX 7
#define DPPIC130_CH_NUM_SIZE 8
#define DPPIC130_GROUP_NUM_MIN 0
#define DPPIC130_GROUP_NUM_MAX 1
#define DPPIC130_GROUP_NUM_SIZE 2

#define DPPIC131_HASCHANNELGROUPS 1
#define DPPIC131_CH_NUM_MIN 0
#define DPPIC131_CH_NUM_MAX 7
#define DPPIC131_CH_NUM_SIZE 8
#define DPPIC131_GROUP_NUM_MIN 0
#define DPPIC131_GROUP_NUM_MAX 1
#define DPPIC131_GROUP_NUM_SIZE 2

#define DPPIC132_HASCHANNELGROUPS 1
#define DPPIC132_CH_NUM_MIN 0
#define DPPIC132_CH_NUM_MAX 7
#define DPPIC132_CH_NUM_SIZE 8
#define DPPIC132_GROUP_NUM_MIN 0
#define DPPIC132_GROUP_NUM_MAX 1
#define DPPIC132_GROUP_NUM_SIZE 2

#define DPPIC133_HASCHANNELGROUPS 1
#define DPPIC133_CH_NUM_MIN 0
#define DPPIC133_CH_NUM_MAX 7
#define DPPIC133_CH_NUM_SIZE 8
#define DPPIC133_GROUP_NUM_MIN 0
#define DPPIC133_GROUP_NUM_MAX 1
#define DPPIC133_GROUP_NUM_SIZE 2

#define DPPIC134_HASCHANNELGROUPS 1
#define DPPIC134_CH_NUM_MIN 0
#define DPPIC134_CH_NUM_MAX 7
#define DPPIC134_CH_NUM_SIZE 8
#define DPPIC134_GROUP_NUM_MIN 0
#define DPPIC134_GROUP_NUM_MAX 1
#define DPPIC134_GROUP_NUM_SIZE 2

#define DPPIC135_HASCHANNELGROUPS 1
#define DPPIC135_CH_NUM_MIN 0
#define DPPIC135_CH_NUM_MAX 7
#define DPPIC135_CH_NUM_SIZE 8
#define DPPIC135_GROUP_NUM_MIN 0
#define DPPIC135_GROUP_NUM_MAX 1
#define DPPIC135_GROUP_NUM_SIZE 2

#define DPPIC136_HASCHANNELGROUPS 1
#define DPPIC136_CH_NUM_MIN 0
#define DPPIC136_CH_NUM_MAX 7
#define DPPIC136_CH_NUM_SIZE 8
#define DPPIC136_GROUP_NUM_MIN 0
#define DPPIC136_GROUP_NUM_MAX 1
#define DPPIC136_GROUP_NUM_SIZE 2

/*PPIB APB registers*/
#define PPIB_PRESENT 1
#define PPIB_COUNT 2

#define PPIB020_NTASKSEVENTS_MIN 0
#define PPIB020_NTASKSEVENTS_MAX 15
#define PPIB020_NTASKSEVENTS_SIZE 16

#define PPIB030_NTASKSEVENTS_MIN 0
#define PPIB030_NTASKSEVENTS_MAX 15
#define PPIB030_NTASKSEVENTS_SIZE 16

/*Event generator unit*/
#define EGU_PRESENT 1
#define EGU_COUNT 2

