pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_radiocore_peripherals.h
#define EGU020_PEND 0
#define EGU020_CH_NUM_MIN 0
#define EGU020_CH_NUM_MAX 15
#define EGU020_CH_NUM_SIZE 16

#define EGU130_PEND 0
#define EGU130_CH_NUM_MIN 0
#define EGU130_CH_NUM_MAX 7
#define EGU130_CH_NUM_SIZE 8

/*Timer/Counter*/
#define TIMER_PRESENT 1
#define TIMER_COUNT 13

#define TIMER020_CC_NUM_MIN 0
#define TIMER020_CC_NUM_MAX 7
#define TIMER020_CC_NUM_SIZE 8
#define TIMER020_MAX_SIZE_MIN 0
#define TIMER020_MAX_SIZE_MAX 31
#define TIMER020_MAX_SIZE_SIZE 32
#define TIMER020_PCLK_MHZ 32
#define TIMER020_PCLK_VARIABLE 0

#define TIMER021_CC_NUM_MIN 0
#define TIMER021_CC_NUM_MAX 7
#define TIMER021_CC_NUM_SIZE 8
#define TIMER021_MAX_SIZE_MIN 0
#define TIMER021_MAX_SIZE_MAX 31
#define TIMER021_MAX_SIZE_SIZE 32
#define TIMER021_PCLK_MHZ 32
#define TIMER021_PCLK_VARIABLE 0

#define TIMER022_CC_NUM_MIN 0
#define TIMER022_CC_NUM_MAX 7
#define TIMER022_CC_NUM_SIZE 8
#define TIMER022_MAX_SIZE_MIN 0
#define TIMER022_MAX_SIZE_MAX 31
#define TIMER022_MAX_SIZE_SIZE 32
#define TIMER022_PCLK_MHZ 32
#define TIMER022_PCLK_VARIABLE 0

#define TIMER120_CC_NUM_MIN 0
#define TIMER120_CC_NUM_MAX 5
#define TIMER120_CC_NUM_SIZE 6
#define TIMER120_MAX_SIZE_MIN 0
#define TIMER120_MAX_SIZE_MAX 31
#define TIMER120_MAX_SIZE_SIZE 32
#define TIMER120_PCLK_MHZ 320
#define TIMER120_PCLK_VARIABLE 0

#define TIMER121_CC_NUM_MIN 0
#define TIMER121_CC_NUM_MAX 5
#define TIMER121_CC_NUM_SIZE 6
#define TIMER121_MAX_SIZE_MIN 0
#define TIMER121_MAX_SIZE_MAX 31
#define TIMER121_MAX_SIZE_SIZE 32
#define TIMER121_PCLK_MHZ 320
#define TIMER121_PCLK_VARIABLE 0

#define TIMER130_CC_NUM_MIN 0
#define TIMER130_CC_NUM_MAX 5
#define TIMER130_CC_NUM_SIZE 6
#define TIMER130_MAX_SIZE_MIN 0
#define TIMER130_MAX_SIZE_MAX 31
#define TIMER130_MAX_SIZE_SIZE 32
#define TIMER130_PCLK_MHZ 16
#define TIMER130_PCLK_VARIABLE 0

#define TIMER131_CC_NUM_MIN 0
#define TIMER131_CC_NUM_MAX 5
#define TIMER131_CC_NUM_SIZE 6
#define TIMER131_MAX_SIZE_MIN 0
#define TIMER131_MAX_SIZE_MAX 31
#define TIMER131_MAX_SIZE_SIZE 32
#define TIMER131_PCLK_MHZ 16
#define TIMER131_PCLK_VARIABLE 0

#define TIMER132_CC_NUM_MIN 0
#define TIMER132_CC_NUM_MAX 5
#define TIMER132_CC_NUM_SIZE 6
#define TIMER132_MAX_SIZE_MIN 0
#define TIMER132_MAX_SIZE_MAX 31
#define TIMER132_MAX_SIZE_SIZE 32
#define TIMER132_PCLK_MHZ 16
#define TIMER132_PCLK_VARIABLE 0

#define TIMER133_CC_NUM_MIN 0
#define TIMER133_CC_NUM_MAX 5
#define TIMER133_CC_NUM_SIZE 6
#define TIMER133_MAX_SIZE_MIN 0
#define TIMER133_MAX_SIZE_MAX 31
#define TIMER133_MAX_SIZE_SIZE 32
#define TIMER133_PCLK_MHZ 16
#define TIMER133_PCLK_VARIABLE 0

#define TIMER134_CC_NUM_MIN 0
#define TIMER134_CC_NUM_MAX 5
#define TIMER134_CC_NUM_SIZE 6
#define TIMER134_MAX_SIZE_MIN 0
#define TIMER134_MAX_SIZE_MAX 31
#define TIMER134_MAX_SIZE_SIZE 32
#define TIMER134_PCLK_MHZ 16
#define TIMER134_PCLK_VARIABLE 0

#define TIMER135_CC_NUM_MIN 0
#define TIMER135_CC_NUM_MAX 5
#define TIMER135_CC_NUM_SIZE 6
#define TIMER135_MAX_SIZE_MIN 0
#define TIMER135_MAX_SIZE_MAX 31
#define TIMER135_MAX_SIZE_SIZE 32
#define TIMER135_PCLK_MHZ 16
#define TIMER135_PCLK_VARIABLE 0

#define TIMER136_CC_NUM_MIN 0
#define TIMER136_CC_NUM_MAX 5
#define TIMER136_CC_NUM_SIZE 6
#define TIMER136_MAX_SIZE_MIN 0
#define TIMER136_MAX_SIZE_MAX 31
#define TIMER136_MAX_SIZE_SIZE 32
#define TIMER136_PCLK_MHZ 16
#define TIMER136_PCLK_VARIABLE 0

#define TIMER137_CC_NUM_MIN 0
#define TIMER137_CC_NUM_MAX 5
#define TIMER137_CC_NUM_SIZE 6
#define TIMER137_MAX_SIZE_MIN 0
#define TIMER137_MAX_SIZE_MAX 31
#define TIMER137_MAX_SIZE_SIZE 32
#define TIMER137_PCLK_MHZ 16
#define TIMER137_PCLK_VARIABLE 0

/*Real-time counter*/
#define RTC_PRESENT 1
#define RTC_COUNT 3

#define RTC_CC_NUM_MIN 0
#define RTC_CC_NUM_MAX 7
#define RTC_CC_NUM_SIZE 8
#define RTC_BIT_WIDTH_MIN 0
#define RTC_BIT_WIDTH_MAX 23
#define RTC_BIT_WIDTH_SIZE 24
#define RTC_LFCLK_ENABLE 0

#define RTC130_CC_NUM_MIN 0
#define RTC130_CC_NUM_MAX 3
#define RTC130_CC_NUM_SIZE 4
#define RTC130_BIT_WIDTH_MIN 0
#define RTC130_BIT_WIDTH_MAX 23
#define RTC130_BIT_WIDTH_SIZE 24
#define RTC130_LFCLK_ENABLE 0

#define RTC131_CC_NUM_MIN 0
#define RTC131_CC_NUM_MAX 3
#define RTC131_CC_NUM_SIZE 4
#define RTC131_BIT_WIDTH_MIN 0
#define RTC131_BIT_WIDTH_MAX 23
#define RTC131_BIT_WIDTH_SIZE 24
#define RTC131_LFCLK_ENABLE 0

/*2.4 GHz radio*/
#define RADIO_PRESENT 1
#define RADIO_COUNT 1

#define RADIO_IRQ_COUNT 2
#define RADIO_ADPLLCOMPANION_INCLUDE_DMA 0
#define RADIO_PERPOWER 1

/*VPR peripheral registers*/
#define VPR_PRESENT 1
#define VPR_COUNT 3

#define VPR_INIT_PC_RESET_VALUE 0x00000000
#define VPR_VPR_START_RESET_VALUE 0
#define VPR_RAM_BASE_ADDR 0x23040000
#define VPR_RAM_SZ 15
#define VPR_RETAINED 1
#define VPR_VPRSAVEDCTX 0
#define VPR_VPRSAVEADDR 0x00000000
#define VPR_VPRREMAPADDRVTOB 0x00000000
#define VPR_VEVIF_NTASKS_MIN 0
#define VPR_VEVIF_NTASKS_MAX 15
#define VPR_VEVIF_NTASKS_SIZE 16
#define VPR_VEVIF_TASKS_MASK 0x0000FF00
#define VPR_VEVIF_NDPPI_MIN 8
#define VPR_VEVIF_NDPPI_MAX 10
#define VPR_VEVIF_NDPPI_SIZE 11
#define VPR_VEVIF_NEVENTS_MIN 12
#define VPR_VEVIF_NEVENTS_MAX 15
#define VPR_VEVIF_NEVENTS_SIZE 16
#define VPR_DEBUGGER_OFFSET 1024

#define VPR121_INIT_PC_RESET_VALUE 0x00000000
#define VPR121_VPR_START_RESET_VALUE 0
#define VPR121_RAM_BASE_ADDR 0x2F890000
#define VPR121_RAM_SZ 15
#define VPR121_VPRSAVEDCTX_REGNAME NRF_MEMCONF120->POWER[0].RET
#define VPR121_VPRSAVEDCTX_REGBIT 23
#define VPR121_RETAINED 0
#define VPR121_VPRSAVEDCTX 1
#define VPR121_VPRSAVEADDR 0x2F800000
#define VPR121_VPRREMAPADDRVTOB 0x00000000
#define VPR121_VEVIF_NTASKS_MIN 0
#define VPR121_VEVIF_NTASKS_MAX 31
#define VPR121_VEVIF_NTASKS_SIZE 32
#define VPR121_VEVIF_TASKS_MASK 0xFFFF0000
#define VPR121_VEVIF_NDPPI_MIN 24
#define VPR121_VEVIF_NDPPI_MAX 27
#define VPR121_VEVIF_NDPPI_SIZE 28
#define VPR121_VEVIF_NEVENTS_MIN 28
#define VPR121_VEVIF_NEVENTS_MAX 31
#define VPR121_VEVIF_NEVENTS_SIZE 32
#define VPR121_DEBUGGER_OFFSET 1024

#define VPR130_INIT_PC_RESET_VALUE 0x00000000
#define VPR130_VPR_START_RESET_VALUE 0
#define VPR130_RAM_BASE_ADDR 0x2FC00000
#define VPR130_RAM_SZ 15
#define VPR130_VPRSAVEDCTX_REGNAME NRF_MEMCONF130->POWER[0].RET
#define VPR130_VPRSAVEDCTX_REGBIT 5
#define VPR130_RETAINED 1
#define VPR130_VPRSAVEDCTX 1
#define VPR130_VPRSAVEADDR 0x2F800000
#define VPR130_VPRREMAPADDRVTOB 0x00000000
#define VPR130_VEVIF_NTASKS_MIN 0
#define VPR130_VEVIF_NTASKS_MAX 15
#define VPR130_VEVIF_NTASKS_SIZE 16
#define VPR130_VEVIF_TASKS_MASK 0x0000FFF0
#define VPR130_VEVIF_NDPPI_MIN 8
#define VPR130_VEVIF_NDPPI_MAX 11
#define VPR130_VEVIF_NDPPI_SIZE 12
#define VPR130_VEVIF_NEVENTS_MIN 12
#define VPR130_VEVIF_NEVENTS_MAX 15
#define VPR130_VEVIF_NEVENTS_SIZE 16
#define VPR130_DEBUGGER_OFFSET 1024

/*Accelerated Address Resolver*/
#define AAR_PRESENT 1
#define AAR_COUNT 2

#define AAR030_DMAERROR 1
#define AAR030_ERRORSTATUS 1
#define AAR030_ERROREVENT 1

