pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_radiocore_peripherals.h
#define AAR031_DMAERROR 1
#define AAR031_ERRORSTATUS 1
#define AAR031_ERROREVENT 1

/*AES CCM Mode Encryption*/
#define CCM_PRESENT 1
#define CCM_COUNT 2

#define CCM030_AMOUNTREG 0
#define CCM030_ONTHEFLYDECRYPTION 0
#define CCM030_DMAERROR 0

#define CCM031_AMOUNTREG 0
#define CCM031_ONTHEFLYDECRYPTION 0
#define CCM031_DMAERROR 0

/*AES ECB Mode Encryption*/
#define ECB_PRESENT 1
#define ECB_COUNT 2

#define ECB030_AMOUNTREG 0
#define ECB030_DMAERROR 1
#define ECB030_ERRORSTATUS 1

#define ECB031_AMOUNTREG 0
#define ECB031_DMAERROR 1
#define ECB031_ERRORSTATUS 1

/*IPCT APB registers*/
#define IPCT_PRESENT 1
#define IPCT_COUNT 3

#define IPCT_IRQ_COUNT 2

#define IPCT120_IRQ_COUNT 1

#define IPCT130_IRQ_COUNT 1

/*Software interrupt*/
#define SWI_PRESENT 1
#define SWI_COUNT 8

/*BELLBOARD APB registers*/
#define BELLBOARD_PRESENT 1
#define BELLBOARD_COUNT 1

#define BELLBOARD_IRQ_COUNT 4

/*Factory Information Configuration Registers*/
#define FICR_PRESENT 1
#define FICR_COUNT 1

/*USBHSCORE*/
#define USBHSCORE_PRESENT 1
#define USBHSCORE_COUNT 1

/*I3CCORE*/
#define I3CCORE_PRESENT 1
#define I3CCORE_COUNT 2

/*DMU*/
#define DMU_PRESENT 1
#define DMU_COUNT 2

/*MCAN*/
#define MCAN_PRESENT 1
#define MCAN_COUNT 2

/*System Trace Macrocell data buffer*/
#define STMDATA_PRESENT 1
#define STMDATA_COUNT 1

/*TDDCONF*/
#define TDDCONF_PRESENT 1
#define TDDCONF_COUNT 1

#define TDDCONF_FEATEN_TDDCONF_CLK_320MHZ 0
#define TDDCONF_FEATEN_TDDCONF_CLK_400MHZ 1

/*System Trace Macrocell*/
#define STM_PRESENT 1
#define STM_COUNT 1

/*Trace Port Interface Unit*/
#define TPIU_PRESENT 1
#define TPIU_COUNT 1

/*ATB Replicator module*/
#define ATBREPLICATOR_PRESENT 1
#define ATBREPLICATOR_COUNT 4

/*ATB funnel module*/
#define ATBFUNNEL_PRESENT 1
#define ATBFUNNEL_COUNT 4

/*GPIO Tasks and Events*/
#define GPIOTE_PRESENT 1
#define GPIOTE_COUNT 2

#define GPIOTE130_IRQ_COUNT 2
#define GPIOTE130_GPIOTE_NCHANNELS_MIN 0
#define GPIOTE130_GPIOTE_NCHANNELS_MAX 7
#define GPIOTE130_GPIOTE_NCHANNELS_SIZE 8
#define GPIOTE130_GPIOTE_NPORTEVENTS_MIN 0
#define GPIOTE130_GPIOTE_NPORTEVENTS_MAX 3
#define GPIOTE130_GPIOTE_NPORTEVENTS_SIZE 4
#define GPIOTE130_GPIOTE_NINTERRUPTS_MIN 0
#define GPIOTE130_GPIOTE_NINTERRUPTS_MAX 1
#define GPIOTE130_GPIOTE_NINTERRUPTS_SIZE 2
#define GPIOTE130_HAS_PORT_EVENT 1

#define GPIOTE131_IRQ_COUNT 2
#define GPIOTE131_GPIOTE_NCHANNELS_MIN 0
#define GPIOTE131_GPIOTE_NCHANNELS_MAX 7
#define GPIOTE131_GPIOTE_NCHANNELS_SIZE 8
#define GPIOTE131_GPIOTE_NPORTEVENTS_MIN 0
#define GPIOTE131_GPIOTE_NPORTEVENTS_MAX 3
#define GPIOTE131_GPIOTE_NPORTEVENTS_SIZE 4
#define GPIOTE131_GPIOTE_NINTERRUPTS_MIN 0
#define GPIOTE131_GPIOTE_NINTERRUPTS_MAX 1
#define GPIOTE131_GPIOTE_NINTERRUPTS_SIZE 2
#define GPIOTE131_HAS_PORT_EVENT 1

/*Global Real-time counter*/
#define GRTC_PRESENT 1
#define GRTC_COUNT 1

#define GRTC_IRQ_COUNT 3
#define GRTC_MSBWIDTH_MIN 0                          /*!< Width of the RTCOUNTERH, RTCOMPAREH and RTCOMPARESYNCH registers :
                                                          0..14*/
#define GRTC_MSBWIDTH_MAX 14                         /*!< Width of the RTCOUNTERH, RTCOMPAREH and RTCOMPARESYNCH registers :
                                                          0..14*/
#define GRTC_MSBWIDTH_SIZE 15                        /*!< Width of the RTCOUNTERH, RTCOMPAREH and RTCOMPARESYNCH registers :
                                                          0..14*/
#define GRTC_NCC_MIN 0
#define GRTC_NCC_MAX 15
#define GRTC_NCC_SIZE 16
#define GRTC_NTIMEOUT_MIN 0
#define GRTC_NTIMEOUT_MAX 15
#define GRTC_NTIMEOUT_SIZE 16
#define GRTC_NDOMAIN_MIN 0
#define GRTC_NDOMAIN_MAX 15
#define GRTC_NDOMAIN_SIZE 16
#define GRTC_GRTC_NINTERRUPTS_MIN 0
#define GRTC_GRTC_NINTERRUPTS_MAX 2
#define GRTC_GRTC_NINTERRUPTS_SIZE 3
#define GRTC_PWMREGS 1
#define GRTC_CLKOUTREG 1
#define GRTC_CLKSELREG 1
#define GRTC_CLKSELLFLPRC 0
#define GRTC_CCADD_WRITE_ONLY 0
#define GRTC_READY_STATUS_AND_EVENTS 0

/*Trace buffer monitor*/
#define TBM_PRESENT 1
#define TBM_COUNT 1

/*USBHS*/
#define USBHS_PRESENT 1
#define USBHS_COUNT 1

/*External Memory Interface*/
#define EXMIF_PRESENT 1
#define EXMIF_COUNT 1

/*BELLBOARD public registers*/
#define BELLBOARDPUBLIC_PRESENT 1
#define BELLBOARDPUBLIC_COUNT 1

/*AUXPLL*/
#define AUXPLL_PRESENT 1
#define AUXPLL_COUNT 1

/*VPR peripheral registers*/
#define VPRPUBLIC_PRESENT 1
#define VPRPUBLIC_COUNT 1

#define VPR120_VEVIF_NTASKS_MIN 0
#define VPR120_VEVIF_NTASKS_MAX 31
#define VPR120_VEVIF_NTASKS_SIZE 32
#define VPR120_VEVIF_TASKS_MASK 0xFFFFF0FF

/*MUTEX*/
#define MUTEX_PRESENT 1
#define MUTEX_COUNT 2

/*I3C*/
#define I3C_PRESENT 1
#define I3C_COUNT 2

/*Controller Area Network*/
#define CAN_PRESENT 1
#define CAN_COUNT 2

/*Pulse width modulation unit*/
#define PWM_PRESENT 1
#define PWM_COUNT 5

#define PWM120_IDLE_OUT 1
#define PWM120_COMPARE_MATCH 1
#define PWM120_FEATURES_V2 0
#define PWM120_NO_FEATURES_V2 1
#define PWM120_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define PWM130_IDLE_OUT 1
#define PWM130_COMPARE_MATCH 1
#define PWM130_FEATURES_V2 0
#define PWM130_NO_FEATURES_V2 1
#define PWM130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define PWM131_IDLE_OUT 1
#define PWM131_COMPARE_MATCH 1
#define PWM131_FEATURES_V2 0
#define PWM131_NO_FEATURES_V2 1
#define PWM131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define PWM132_IDLE_OUT 1
#define PWM132_COMPARE_MATCH 1
#define PWM132_FEATURES_V2 0
#define PWM132_NO_FEATURES_V2 1
#define PWM132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define PWM133_IDLE_OUT 1
#define PWM133_COMPARE_MATCH 1
#define PWM133_FEATURES_V2 0
#define PWM133_NO_FEATURES_V2 1
#define PWM133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

/*SPI Slave*/
#define SPIS_PRESENT 1
#define SPIS_COUNT 9

#define SPIS120_EASYDMA_MAXCNT_MIN 0
#define SPIS120_EASYDMA_MAXCNT_MAX 14
#define SPIS120_EASYDMA_MAXCNT_SIZE 15
#define SPIS120_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define SPIS130_EASYDMA_MAXCNT_MIN 0
#define SPIS130_EASYDMA_MAXCNT_MAX 14
#define SPIS130_EASYDMA_MAXCNT_SIZE 15
#define SPIS130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define SPIS131_EASYDMA_MAXCNT_MIN 0
#define SPIS131_EASYDMA_MAXCNT_MAX 14
#define SPIS131_EASYDMA_MAXCNT_SIZE 15
#define SPIS131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define SPIS132_EASYDMA_MAXCNT_MIN 0
#define SPIS132_EASYDMA_MAXCNT_MAX 14
#define SPIS132_EASYDMA_MAXCNT_SIZE 15
#define SPIS132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define SPIS133_EASYDMA_MAXCNT_MIN 0
#define SPIS133_EASYDMA_MAXCNT_MAX 14
#define SPIS133_EASYDMA_MAXCNT_SIZE 15
#define SPIS133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define SPIS134_EASYDMA_MAXCNT_MIN 0
#define SPIS134_EASYDMA_MAXCNT_MAX 14
#define SPIS134_EASYDMA_MAXCNT_SIZE 15
#define SPIS134_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define SPIS135_EASYDMA_MAXCNT_MIN 0
#define SPIS135_EASYDMA_MAXCNT_MAX 14
#define SPIS135_EASYDMA_MAXCNT_SIZE 15
#define SPIS135_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define SPIS136_EASYDMA_MAXCNT_MIN 0
#define SPIS136_EASYDMA_MAXCNT_MAX 14
#define SPIS136_EASYDMA_MAXCNT_SIZE 15
#define SPIS136_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define SPIS137_EASYDMA_MAXCNT_MIN 0
#define SPIS137_EASYDMA_MAXCNT_MAX 14
#define SPIS137_EASYDMA_MAXCNT_SIZE 15
#define SPIS137_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

/*Serial Peripheral Interface Master with EasyDMA*/
#define SPIM_PRESENT 1
#define SPIM_COUNT 10

#define SPIM120_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1
#define SPIM120_MAX_DATARATE 32
#define SPIM120_EASYDMA_MAXCNT_MIN 0
#define SPIM120_EASYDMA_MAXCNT_MAX 14
#define SPIM120_EASYDMA_MAXCNT_SIZE 15
#define SPIM120_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM120_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM120_FEATURE_RXDELAY_PRESENT 1
#define SPIM120_STALL_STATUS_PRESENT 0
#define SPIM120_STALL_STATUS_TX_PRESENT 0
#define SPIM120_NUM_CHIPSELECT_MIN 0
#define SPIM120_NUM_CHIPSELECT_MAX 0
#define SPIM120_NUM_CHIPSELECT_SIZE 1
#define SPIM120_CORE_FREQUENCY 320
#define SPIM120_PRESCALER_PRESENT 1
#define SPIM120_PRESCALER_DIVISOR_RANGE_MIN 4
#define SPIM120_PRESCALER_DIVISOR_RANGE_MAX 126
#define SPIM120_PRESCALER_DIVISOR_RANGE_SIZE 127
#define SPIM120_RXDELAY_VALUE_RANGE_MIN 0
#define SPIM120_RXDELAY_VALUE_RANGE_MAX 7
#define SPIM120_RXDELAY_VALUE_RANGE_SIZE 8
#define SPIM120_RXDELAY_RESET_VALUE 2
#define SPIM120_RXDELAY_FIELD_WIDTH_MIN 0
#define SPIM120_RXDELAY_FIELD_WIDTH_MAX 2
#define SPIM120_RXDELAY_FIELD_WIDTH_SIZE 3

