pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_radiocore_peripherals.h
#define SPIM135_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1
#define SPIM135_MAX_DATARATE 8
#define SPIM135_EASYDMA_MAXCNT_MIN 0
#define SPIM135_EASYDMA_MAXCNT_MAX 14
#define SPIM135_EASYDMA_MAXCNT_SIZE 15
#define SPIM135_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM135_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM135_FEATURE_RXDELAY_PRESENT 1
#define SPIM135_STALL_STATUS_PRESENT 0
#define SPIM135_STALL_STATUS_TX_PRESENT 0
#define SPIM135_NUM_CHIPSELECT_MIN 0
#define SPIM135_NUM_CHIPSELECT_MAX 0
#define SPIM135_NUM_CHIPSELECT_SIZE 1
#define SPIM135_CORE_FREQUENCY 16
#define SPIM135_PRESCALER_PRESENT 1
#define SPIM135_PRESCALER_DIVISOR_RANGE_MIN 2
#define SPIM135_PRESCALER_DIVISOR_RANGE_MAX 126
#define SPIM135_PRESCALER_DIVISOR_RANGE_SIZE 127
#define SPIM135_RXDELAY_VALUE_RANGE_MIN 0
#define SPIM135_RXDELAY_VALUE_RANGE_MAX 7
#define SPIM135_RXDELAY_VALUE_RANGE_SIZE 8
#define SPIM135_RXDELAY_RESET_VALUE 2
#define SPIM135_RXDELAY_FIELD_WIDTH_MIN 0
#define SPIM135_RXDELAY_FIELD_WIDTH_MAX 2
#define SPIM135_RXDELAY_FIELD_WIDTH_SIZE 3

#define SPIM136_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1
#define SPIM136_MAX_DATARATE 8
#define SPIM136_EASYDMA_MAXCNT_MIN 0
#define SPIM136_EASYDMA_MAXCNT_MAX 14
#define SPIM136_EASYDMA_MAXCNT_SIZE 15
#define SPIM136_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM136_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM136_FEATURE_RXDELAY_PRESENT 1
#define SPIM136_STALL_STATUS_PRESENT 0
#define SPIM136_STALL_STATUS_TX_PRESENT 0
#define SPIM136_NUM_CHIPSELECT_MIN 0
#define SPIM136_NUM_CHIPSELECT_MAX 0
#define SPIM136_NUM_CHIPSELECT_SIZE 1
#define SPIM136_CORE_FREQUENCY 16
#define SPIM136_PRESCALER_PRESENT 1
#define SPIM136_PRESCALER_DIVISOR_RANGE_MIN 2
#define SPIM136_PRESCALER_DIVISOR_RANGE_MAX 126
#define SPIM136_PRESCALER_DIVISOR_RANGE_SIZE 127
#define SPIM136_RXDELAY_VALUE_RANGE_MIN 0
#define SPIM136_RXDELAY_VALUE_RANGE_MAX 7
#define SPIM136_RXDELAY_VALUE_RANGE_SIZE 8
#define SPIM136_RXDELAY_RESET_VALUE 2
#define SPIM136_RXDELAY_FIELD_WIDTH_MIN 0
#define SPIM136_RXDELAY_FIELD_WIDTH_MAX 2
#define SPIM136_RXDELAY_FIELD_WIDTH_SIZE 3

#define SPIM137_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1
#define SPIM137_MAX_DATARATE 8
#define SPIM137_EASYDMA_MAXCNT_MIN 0
#define SPIM137_EASYDMA_MAXCNT_MAX 14
#define SPIM137_EASYDMA_MAXCNT_SIZE 15
#define SPIM137_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM137_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM137_FEATURE_RXDELAY_PRESENT 1
#define SPIM137_STALL_STATUS_PRESENT 0
#define SPIM137_STALL_STATUS_TX_PRESENT 0
#define SPIM137_NUM_CHIPSELECT_MIN 0
#define SPIM137_NUM_CHIPSELECT_MAX 0
#define SPIM137_NUM_CHIPSELECT_SIZE 1
#define SPIM137_CORE_FREQUENCY 16
#define SPIM137_PRESCALER_PRESENT 1
#define SPIM137_PRESCALER_DIVISOR_RANGE_MIN 2
#define SPIM137_PRESCALER_DIVISOR_RANGE_MAX 126
#define SPIM137_PRESCALER_DIVISOR_RANGE_SIZE 127
#define SPIM137_RXDELAY_VALUE_RANGE_MIN 0
#define SPIM137_RXDELAY_VALUE_RANGE_MAX 7
#define SPIM137_RXDELAY_VALUE_RANGE_SIZE 8
#define SPIM137_RXDELAY_RESET_VALUE 2
#define SPIM137_RXDELAY_FIELD_WIDTH_MIN 0
#define SPIM137_RXDELAY_FIELD_WIDTH_MAX 2
#define SPIM137_RXDELAY_FIELD_WIDTH_SIZE 3

/*UART with EasyDMA*/
#define UARTE_PRESENT 1
#define UARTE_COUNT 9

#define UARTE120_EASYDMA_MAXCNT_MIN 0
#define UARTE120_EASYDMA_MAXCNT_MAX 14
#define UARTE120_EASYDMA_MAXCNT_SIZE 15
#define UARTE120_TIMEOUT_INTERRUPT 1
#define UARTE120_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE120_CORE_FREQUENCY 320
#define UARTE120_CORE_CLOCK_320 1
#define UARTE120_SHORTS_ENDTX_STOPTX 1
#define UARTE120_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define UARTE130_EASYDMA_MAXCNT_MIN 0
#define UARTE130_EASYDMA_MAXCNT_MAX 14
#define UARTE130_EASYDMA_MAXCNT_SIZE 15
#define UARTE130_TIMEOUT_INTERRUPT 1
#define UARTE130_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE130_CORE_FREQUENCY 16
#define UARTE130_CORE_CLOCK_16 1
#define UARTE130_SHORTS_ENDTX_STOPTX 1
#define UARTE130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define UARTE131_EASYDMA_MAXCNT_MIN 0
#define UARTE131_EASYDMA_MAXCNT_MAX 14
#define UARTE131_EASYDMA_MAXCNT_SIZE 15
#define UARTE131_TIMEOUT_INTERRUPT 1
#define UARTE131_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE131_CORE_FREQUENCY 16
#define UARTE131_CORE_CLOCK_16 1
#define UARTE131_SHORTS_ENDTX_STOPTX 1
#define UARTE131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define UARTE132_EASYDMA_MAXCNT_MIN 0
#define UARTE132_EASYDMA_MAXCNT_MAX 14
#define UARTE132_EASYDMA_MAXCNT_SIZE 15
#define UARTE132_TIMEOUT_INTERRUPT 1
#define UARTE132_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE132_CORE_FREQUENCY 16
#define UARTE132_CORE_CLOCK_16 1
#define UARTE132_SHORTS_ENDTX_STOPTX 1
#define UARTE132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define UARTE133_EASYDMA_MAXCNT_MIN 0
#define UARTE133_EASYDMA_MAXCNT_MAX 14
#define UARTE133_EASYDMA_MAXCNT_SIZE 15
#define UARTE133_TIMEOUT_INTERRUPT 1
#define UARTE133_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE133_CORE_FREQUENCY 16
#define UARTE133_CORE_CLOCK_16 1
#define UARTE133_SHORTS_ENDTX_STOPTX 1
#define UARTE133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define UARTE134_EASYDMA_MAXCNT_MIN 0
#define UARTE134_EASYDMA_MAXCNT_MAX 14
#define UARTE134_EASYDMA_MAXCNT_SIZE 15
#define UARTE134_TIMEOUT_INTERRUPT 1
#define UARTE134_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE134_CORE_FREQUENCY 16
#define UARTE134_CORE_CLOCK_16 1
#define UARTE134_SHORTS_ENDTX_STOPTX 1
#define UARTE134_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define UARTE135_EASYDMA_MAXCNT_MIN 0
#define UARTE135_EASYDMA_MAXCNT_MAX 14
#define UARTE135_EASYDMA_MAXCNT_SIZE 15
#define UARTE135_TIMEOUT_INTERRUPT 1
#define UARTE135_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE135_CORE_FREQUENCY 16
#define UARTE135_CORE_CLOCK_16 1
#define UARTE135_SHORTS_ENDTX_STOPTX 1
#define UARTE135_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define UARTE136_EASYDMA_MAXCNT_MIN 0
#define UARTE136_EASYDMA_MAXCNT_MAX 14
#define UARTE136_EASYDMA_MAXCNT_SIZE 15
#define UARTE136_TIMEOUT_INTERRUPT 1
#define UARTE136_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE136_CORE_FREQUENCY 16
#define UARTE136_CORE_CLOCK_16 1
#define UARTE136_SHORTS_ENDTX_STOPTX 1
#define UARTE136_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

#define UARTE137_EASYDMA_MAXCNT_MIN 0
#define UARTE137_EASYDMA_MAXCNT_MAX 14
#define UARTE137_EASYDMA_MAXCNT_SIZE 15
#define UARTE137_TIMEOUT_INTERRUPT 1
#define UARTE137_CONFIGURABLE_DATA_FRAME_SIZE 1
#define UARTE137_CORE_FREQUENCY 16
#define UARTE137_CORE_CLOCK_16 1
#define UARTE137_SHORTS_ENDTX_STOPTX 1
#define UARTE137_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1

/*GPIO Port*/
#define GPIO_PRESENT 1
#define GPIO_COUNT 10

