pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_radiocore_peripherals.h
/* ============================================= SPU020 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU020.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_CH_0    = 0,
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_CH_1    = 1,
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_CH_2    = 2,
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_CH_3    = 3,
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_CH_4    = 4,
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_CH_5    = 5,
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_CH_6    = 6,
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_CH_7    = 7,
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_INTERRUPT_0 = 24,
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_INTERRUPT_1 = 25,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_0 = 32,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_1 = 33,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_2 = 34,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_3 = 35,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_4 = 36,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_5 = 37,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_6 = 38,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_7 = 39,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_8 = 40,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_9 = 41,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_10 = 42,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_11 = 43,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_12 = 44,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_13 = 45,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_14 = 46,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_15 = 47,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_16 = 48,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_17 = 49,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_18 = 50,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_19 = 51,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_20 = 52,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_21 = 53,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_22 = 54,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_23 = 55,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CHG_0 = 56,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CHG_1 = 57,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CHG_2 = 58,
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CHG_3 = 59,
} NRF_RADIOCORE_SPU020_FEATURES_ENUM_t;

/* ============================================= SPU030 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU030.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_0 = 32,
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_1 = 33,
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_2 = 34,
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_3 = 35,
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_4 = 36,
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_5 = 37,
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_6 = 38,
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_7 = 39,
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_8 = 40,
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_9 = 41,
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_10 = 42,
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_11 = 43,
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_12 = 44,
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_13 = 45,
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_14 = 46,
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_15 = 47,
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CHG_0 = 56,
} NRF_RADIOCORE_SPU030_FEATURES_ENUM_t;


#ifdef __cplusplus
}
#endif
#endif /* NRF9230_ENGB_RADIOCORE_PERIPHERALS_H */

